"""
Задание 2. Выполнить логические побитовые операции "И", "ИЛИ"
и др. над числами 5 и 6. Выполнить
над числом 5 побитовый сдвиг вправо и влево на два знака.

Подсказка: это стандартные операции, которые осуществляются с помощью
стандартных операторов. Попробуйте найти каких именно.
"""

print(f'Битовое ИЛИ (OR) 5 | 6 = {5 | 6}')
print(f'Битовое И (AND) 5 & 6 = {5 & 6}')
print(f'Битовое ИСКЛЮЧАЮЩЕЕ ИЛИ (XOR) 5 ^ 6 = {5 ^ 6}')
print(f'Битовое ОТРИЦАНИЕ (NOT) ~6 = {~6}')
print(f'Побитовый сдвиг влево на 2 бита числа 5 = {5 << 2}')
print(f'Побитовый сдвиг вправо на 2 бита числа 5 = {5 >> 2}')
